In [8]:
import tomotopy as tp
import numpy as np
import pandas as pd
import re
import os
import time
import itertools
import konlpy
from kiwipiepy import Kiwi
from hanspell import spell_checker
from tqdm import tqdm
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
import pyLDAvis

In [9]:
forders=os.listdir('C:/Users/jenny/1115rawdata')

df=pd.DataFrame()
for files in forders:
    if files in ['activity.csv','plus.csv','leisure2.csv','secondary.csv'] :
        temp=pd.read_csv(files, encoding='utf-8-sig',header=0)
        df=pd.concat([df,temp])
    else:
        pass

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22886 entries, 0 to 5034
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   review_title  22886 non-null  object
 1   review        22886 non-null  object
 2   score         22886 non-null  int64
 3   real_date     22886 non-null  object
 4   year          22886 non-null  float64
 5   month         22886 non-null  float64
 6   type          20366 non-null  object
 7   dataset       22554 non-null  object
 8   Unnamed: 0    12029 non-null  float64
dtypes: float64(3), int64(1), object(5)
memory usage: 1.7+ MB

In [11]:
df.head()

,review_title,review,score,real_date,year,month,type,dataset,Unnamed: 0
0,우리 가족도 즐길 수 있는 난타!,"내 가족, 포함한 14, 12, 9살 고 - 아이들은, 모든 난타 명동 극장에서 즐...",5,2015년 8월,2015.0,8.0,가족,"우리 가족도 즐길 수 있는 난타! 내 가족, 포함한 14, 12, 9살 고 - 아이...",NaN
1,좋은 곳에 좋은 비지니스 여행객 수 없습니다.,아주 좋은 이유가 있지만 저는 업무 때문에 방문. 성능은 좋지만 주차할 곳이 없어...,4,2015년 12월,2015.0,12.0,비지니스,좋은 곳에 좋은 비즈니스 여행객 수 없습니다. 아주 좋은 이유가 있지만 저는 업무 ...,NaN
2,쇼핑 중에 즐길 수 있는 공연,명동 한가운데 있어 접근성이 좋습니다. 유네스코 빌딩안에 있는데 난타 극장을 제외하...,3,2016년 6월,2016.0,6.0,개인,쇼핑 중에 즐길 수 있는 공연 명동 한가운데 있어 접근성이 좋습니다. 유네스코 빌딩...,NaN
3,아주 엔터테인먼트 쇼,"모두가 사랑 하는 것이 대화 쇼는 범용 없습니다. 이 함께 곡예, 주방 용품 및 드...",5,2016년 8월,2016.0,8.0,NaN,아주 엔터테인먼트 쇼 모두가 사랑하는 것이 대화 쇼는 범용 없습니다. 이 함께 곡예...,NaN
4,철저하게 즐겁게,제 남편과 저는 이 공연을 즐길 수 있었다. 재능 넘치게 갈 수 있는 캐스트 및. ...,5,2017년 4월,2017.0,4.0,커플,철저하게 즐겁게 제 남편과 저는 이 공연을 즐길 수 있었다. 재능 넘치게 갈 수 있...,NaN

In [14]:
df8=df.groupby(['type','score'])['review']
print(df8.size().reset_index(name='count'))

     type  score  count
0      가족      1     23
1      가족      2     54
2      가족      3    488
3      가족      4   1728
4      가족      5   2303
5      개인      1     24
6      개인      2     57
7      개인      3    361
8      개인      4   1222
9      개인      5   1953
10   비지니스      1      4
11   비지니스      2     13
12   비지니스      3    137
13   비지니스      4    451
14   비지니스      5    745
15     친구      1     21
16     친구      2     94
17     친구      3    598
18     친구      4   2025
19     친구      5   2855
20     커플      1     34
21     커플      2     93
22     커플      3    607
23     커플      4   1765
24     커플      5   2711

In [3]:
df2=pd.read_csv('secondary.csv',header=0,encoding='utf-8-sig')
df3=pd.read_csv('activity.csv',header=0,encoding='utf-8-sig')
df4=pd.read_csv('leisure2.csv',header=0,encoding='utf-8-sig')
df5=pd.read_csv('plus.csv',header=0,encoding='utf-8-sig')

In [4]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5035 entries, 0 to 5034
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   review_title  5035 non-null   object
 1   review        5035 non-null   object
 2   score         5035 non-null   int64
 3   real_date     5035 non-null   object
 4   year          5035 non-null   int64
 5   month         5035 non-null   int64
 6   type          4558 non-null   object
 7   dataset       4966 non-null   object
dtypes: int64(3), object(5)
memory usage: 314.8+ KB

In [12]:
for i in range(len(df2)):
    if df.loc[i,'type'] in [' 친구',' 가족', ' 커플']:
        df.loc[i,'type']='no_solo'
    elif df.loc[i,'type'] in [' 비지니스', np.NaN]:
        df.loc[i,'type']=np.NaN
    else :
        df.loc[i,'type']='solo'

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [5]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2537 entries, 0 to 2536
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   review_title  2537 non-null   object
 1   review        2537 non-null   object
 2   score         2537 non-null   int64
 3   real_date     2537 non-null   object
 4   year          2537 non-null   float64
 5   month         2537 non-null   float64
 6   type          2272 non-null   object
 7   dataset       2500 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 158.7+ KB

In [6]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12029 entries, 0 to 12028
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    12029 non-null  int64
 1   real_date     12029 non-null  object
 2   year          12029 non-null  int64
 3   month         12029 non-null  int64
 4   type          10567 non-null  object
 5   review_title  12029 non-null  object
 6   review        12029 non-null  object
 7   score         12029 non-null  int64
 8   dataset       11869 non-null  object
dtypes: int64(4), object(5)
memory usage: 845.9+ KB

In [7]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3285 entries, 0 to 3284
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   review_title  3285 non-null   object
 1   review        3285 non-null   object
 2   score         3285 non-null   int64
 3   real_date     3285 non-null   object
 4   year          3285 non-null   float64
 5   month         3285 non-null   float64
 6   type          2969 non-null   object
 7   dataset       3219 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 205.4+ KB